# Shop Customer EDA

## By Ibuodinma Somtochukwu I


### Description
>Shop Customer Data a dataset of customers of an ideal shop. The information is supposedly gleaned from the membership cards.

 Dataset consists of 2000 records and 8 columns:

* Customer ID
* Gender
* Age
* Annual Income
* Spending Score - Score assigned by the shop, based on customer behavior and spending nature
* Profession
* Work Experience - in years
* Family Size

### Objectives
* Explore distributions of numeric columns using histograms etc.
* Explore relationship between columns using scatter plots, bar charts etc.
* Derive interesting insights from the exploratory analysis

In [1]:
import pandas as pd
import seaborn as sb
import matplotlib as plt
%matplotlib inline

In [3]:
df_customer = pd.read_csv('Customers.csv')#reading the csv file into a dataframe

In [6]:
df_customer.head(5)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [4]:
df_customer.info()# checking the basic property of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Profession              1965 non-null   object
 6   Work Experience         2000 non-null   int64
 7   Family Size             2000 non-null   int64
dtypes: int64(6), object(2)
memory usage: 125.1+ KB

#### Observations

* The column *Profession* has incomplete data
* 2000 rows and 18 columns
* The numerical data include CustomerID, Annual Income ($), Spending Score (1-100), Work Experience, Family Size
* For ease of evaluation we need to modify the names of the columns eg using underscore to separate the names that comprise two words

In [5]:
df_customer.describe()# basic descriptive stats of the variables

,CustomerID,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,1000.500000,48.960000,110731.821500,50.962500,4.102500,3.768500
std,577.494589,28.429747,45739.536688,27.934661,3.922204,1.970749
min,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,500.750000,25.000000,74572.000000,28.000000,1.000000,2.000000
50%,1000.500000,48.000000,110045.000000,50.000000,3.000000,4.000000
75%,1500.250000,73.000000,149092.750000,75.000000,7.000000,5.000000
max,2000.000000,99.000000,189974.000000,100.000000,17.000000,9.000000

In [15]:
df_customer.columns= df_customer.columns.str.replace(' ', '_')# replacing spaces in the column names with underscores

Dealing with missing values in the *Profession* column

The missing values contain significant data in other columns, hence should not be dropped

We replace 'nan' with 'Not Available'

In [27]:
df_customer[df_customer.Profession.isna()].head()# the missing values

,CustomerID,Gender,Age,Annual_Income_($),Spending_Score_(1-100),Profession,Work_Experience,Family_Size
79,80,Female,49,98000,42,NaN,1,1
118,119,Female,51,84000,43,NaN,2,7
219,220,Female,59,76000,61,NaN,9,1
237,238,Male,95,36000,35,NaN,0,4
437,438,Male,76,136259,14,NaN,0,7

In [28]:
df_customer.Profession= df_customer.Profession.fillna('Not Available')#filling the nan with Not Available

In [30]:
df_customer.Profession.unique()#Checking for the data

array(['Healthcare', 'Engineer', 'Lawyer', 'Entertainment', 'Artist',
       'Executive', 'Doctor', 'Homemaker', 'Marketing', 'Not Available'],
      dtype=object)